#include<stdio.h>
int main(void) {
	int i;
	double money;
	printf("请输入利润：");
	scanf("%d", &i);//get the i;
	if (i < 100000)//分等级求出奖金
		money = i * 0.1;
	else if (i < 200000)
		money = 100000 * 0.1 + (i - 100000) * 0.075;
	else if (i < 400000)
		money = 100000 * 0.1 + 100000 * 0.075 + (i - 200000) * 0.05;
	else if (i < 600000)
		money = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + (i - 400000) * 0.03;
	else if (i < 100000)
		money = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + (i - 600000) * 0.015;
	else money = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + 400000 * 0.015 + (i - 1000000) * 0.01;
	printf("奖金为：%.2f\n", money);
	return 0;
}